"""
AI парсер для извлечения данных из текста объявлений.
Обрабатывает каждое поле по отдельности с типизированными промптами.
"""
import json
from typing import Dict, Any, List, Optional
from langchain_openai import ChatOpenAI
from langchain_core.messages import HumanMessage, SystemMessage
from app.config.settings import OPENAI_API_KEY


# Промпты для разных типов полей
PROMPTS = {
    "drop_down_options": """
Ты — интеллектуальный парсер объявлений о продаже автомобилей.

ТВОЯ ЗАДАЧА:
Найти в тексте объявления значение для поля "{field_title}" и выбрать подходящий вариант из списка options.

ПРАВИЛА:
1. Выбирай ТОЛЬКО из предоставленного списка options
2. Если точного совпадения нет — ищи похожее значение
3. Если значение не найдено в тексте или нет подходящего варианта — верни пустые строки

ФОРМАТ ОТВЕТА (только JSON, без markdown):
{{"label": "название выбранного варианта", "label_id": "id выбранного варианта"}}

Если не найдено:
{{"label": "", "label_id": ""}}
""",

    "textbox_text": """
Ты — интеллектуальный парсер объявлений о продаже автомобилей.

ТВОЯ ЗАДАЧА:
Найти в тексте объявления значение для поля "{field_title}".

ПРАВИЛА:
1. Извлеки текстовое значение напрямую из текста
2. Если значение не найдено — верни пустую строку

ФОРМАТ ОТВЕТА (только JSON, без markdown):
{{"label": "найденное значение"}}

Если не найдено:
{{"label": ""}}
""",

    "textarea_text": """
Ты — интеллектуальный парсер объявлений о продаже автомобилей.

ТВОЯ ЗАДАЧА:
Найти или сформировать значение для поля "{field_title}".

ПРАВИЛА:
1. Для поля "Описание" — извлеки или сформируй описание автомобиля из текста
2. Для поля "Заголовок объявления" — сформируй краткий заголовок (Марка Модель Год)
3. Если информации недостаточно — верни пустую строку

ФОРМАТ ОТВЕТА (только JSON, без markdown):
{{"label": "текст"}}

Если не найдено:
{{"label": ""}}
""",

    "textbox_numeric": """
Ты — интеллектуальный парсер объявлений о продаже автомобилей.

ТВОЯ ЗАДАЧА:
Найти в тексте объявления числовое значение для поля "{field_title}".

ПРАВИЛА:
1. Извлеки только числовое значение (цифры)
2. Убери все лишние символы, пробелы, валюты
3. Если значение не найдено — верни пустую строку

ФОРМАТ ОТВЕТА (только JSON, без markdown):
{{"label": "число"}}

Если не найдено:
{{"label": ""}}
""",

    "textbox_numeric_measurement": """
Ты — интеллектуальный парсер объявлений о продаже автомобилей.

ТВОЯ ЗАДАЧА:
Найти в тексте объявления числовое значение для поля "{field_title}".

ПРАВИЛА:
1. Извлеки только числовое значение (цифры)
2. Убери все лишние символы, пробелы, единицы измерения
3. Для цены — только число без валюты
4. Для пробега — только число без "км" или "mi"
5. Если значение не найдено — верни пустую строку

ФОРМАТ ОТВЕТА (только JSON, без markdown):
{{"label": "число"}}

Если не найдено:
{{"label": ""}}
"""
}

# Промпт для определения поколения
GENERATION_DETECTION_PROMPT = """
Ты — эксперт по автомобилям, специализирующийся на определении поколений автомобилей по VIN-коду и году выпуска.

ТВОЯ ЗАДАЧА:
Определить правильное поколение автомобиля на основе предоставленных данных.

ВХОДНЫЕ ДАННЫЕ:
- VIN-код: {vin}
- Год выпуска: {year}
- Марка: {make}
- Модель: {model}

ДОСТУПНЫЕ ПОКОЛЕНИЯ:
{generations}

ПРАВИЛА:
1. Год выпуска должен попадать в диапазон годов поколения (year_from - year_to)
2. Если год на границе — выбирай более новое поколение
3. VIN-код содержит информацию о годе (символ 10)

ФОРМАТ ОТВЕТА (только JSON, без markdown):
{{"label": "название поколения", "label_id": "id поколения"}}

Если невозможно определить:
{{"label": "", "label_id": ""}}
"""


class AIParserService:
    """Сервис для AI парсинга текста объявлений по одному полю."""

    def __init__(self):
        self.llm = ChatOpenAI(
            model="gpt-4o-mini",
            temperature=0,
            api_key=OPENAI_API_KEY
        )

    def parse_single_field(
        self,
        text: str,
        field: Dict[str, Any],
        options: Optional[List[Dict]] = None
    ) -> Dict[str, Any]:
        """
        Парсит одно поле из текста объявления.
        
        Args:
            text: Текст объявления
            field: Данные поля (id, title, type, options)
            options: Опции для зависимых полей (загруженные через API)
        
        Returns:
            {"label": "...", "label_id": "..."} или {"label": ""}
        """
        field_id = str(field.get("id", ""))
        field_title = field.get("title", "")
        field_type = field.get("type", "textbox_text")
        field_options = options or field.get("options", [])
        
        print(f"🔍 Парсинг поля: {field_title} (ID: {field_id}, Type: {field_type})")
        
        try:
            # Получаем промпт для типа поля
            prompt_template = PROMPTS.get(field_type, PROMPTS["textbox_text"])
            system_prompt = prompt_template.format(field_title=field_title)
            
            # Формируем сообщение пользователя
            user_message = f"ТЕКСТ ОБЪЯВЛЕНИЯ:\n{text}"
            
            # Добавляем options для dropdown
            if field_type == "drop_down_options" and field_options:
                options_text = json.dumps(
                    [{"id": str(o.get("id")), "title": o.get("title") or o.get("name", "")} 
                     for o in field_options],
                    ensure_ascii=False
                )
                user_message += f"\n\nOPTIONS:\n{options_text}"
            
            # Вызов LLM
            messages = [
                SystemMessage(content=system_prompt),
                HumanMessage(content=user_message)
            ]
            
            response = self.llm.invoke(messages)
            output = response.content
            
            # Очистка и парсинг JSON
            result_text = self._clean_json_response(output)
            result = json.loads(result_text)
            
            print(f"✅ Результат для {field_title}: {result}")
            return result
            
        except Exception as e:
            print(f"❌ Ошибка парсинга поля {field_title}: {str(e)}")
            return {"label": "", "label_id": ""} if field_type == "drop_down_options" else {"label": ""}

    def detect_generation(
        self,
        vin: str,
        year: int,
        make: str,
        model: str,
        generations: List[Dict[str, Any]]
    ) -> Dict[str, Any]:
        """
        Определяет поколение автомобиля по VIN-коду и году.
        
        Args:
            vin: VIN-код автомобиля
            year: Год выпуска
            make: Марка
            model: Модель
            generations: Список поколений из API
        
        Returns:
            {"label": "название", "label_id": "id"}
        """
        print(f"🚗 Определение поколения: {make} {model} {year}")
        
        try:
            # Форматируем поколения
            generations_text = json.dumps(generations, ensure_ascii=False, indent=2)
            
            prompt = GENERATION_DETECTION_PROMPT.format(
                vin=vin or "не указан",
                year=year or "не указан",
                make=make or "не указан",
                model=model or "не указан",
                generations=generations_text
            )
            
            messages = [
                SystemMessage(content=prompt),
                HumanMessage(content="Определи поколение автомобиля.")
            ]
            
            response = self.llm.invoke(messages)
            output = response.content
            
            result_text = self._clean_json_response(output)
            result = json.loads(result_text)
            
            print(f"🎯 Поколение: {result}")
            return result
            
        except Exception as e:
            print(f"❌ Ошибка определения поколения: {str(e)}")
            return {"label": "", "label_id": ""}

    def _clean_json_response(self, text: str) -> str:
        """Очищает ответ от markdown и лишних символов."""
        if "```json" in text:
            text = text.split("```json")[1].split("```")[0].strip()
        elif "```" in text:
            text = text.split("```")[1].split("```")[0].strip()
        return text.strip()


# Singleton instance
ai_parser_service = AIParserService()
